{
  "extensionName": {
    "message": "DNS Over HTTPS"
  },
  "extensionDescriptionIntro": {
    "message": "Firefox is running a series of studies to evaluate a service that keeps DNS providers from collecting and sharing your browsing history. All users in the study will receive a notification. When a study is active, Firefox will automatically use Cloudflare’s 1.1.1.1 secure DNS over HTTPS.  This study will use the Cloudflare resolver in addition to the DNS selected by a user or their ISP in order to compare approaches. In this particular study, we will also measure the speed at which websites send and receive data from Firefox, by sending a “payload” of random bytes through a dedicated service run by Akamai to one run by Facebook if you are logged into Facebook."
  },
  "extensionDescriptionDataTitle": {
    "message": "What happens to your data"
  },
  "extensionDescriptionDataDesc": {
    "message": "Cloudflare, like any other DNS provider, needs access to the host names you use to resolve requests. We’ve chosen Cloudflare as our partner for these studies because, unlike many other DNS providers, they agreed to strong privacy controls that include limits on what data they collect and how long they keep it, as well a promise to not share data with other parties. Read the Cloudflare/$BRANDSHORTNAME$ Privacy Policy at https://tinyurl.com/yax6zfqo\n\nThe performance measurement servers do not collect any personal information except for the source IP from which downloads originate and this information is not shared with other parties. The payload sent to Facebook does not contain any personal information, and is sent only if you are already logged into Facebook."
  },
  "extensionDescriptionDisableTitle": {
    "message": "How you can disable DNS studies"
  },
  "extensionDescriptionDisableDesc": {
    "message": "If you don’t want to participate in this DNS study, you can disable it on the about:studies page in Firefox. (Type about:studies into the $BRANDSHORTNAME$ address bar.) To disable all studies in Firefox, you can update your Privacy and Security settings in about:preferences."
  },
  "notificationMessage": {
    "message": "For a limited time, Firefox is conducting a study that routes your DNS requests to a secure service in partnership with Cloudflare to protect you while you browse."
  },
  "disableButtonText": {
    "message": "Disable DNS Studies"
  },
  "acceptButtonText": {
    "message": "OK, Got It"
  },
  "learnMoreLinkText": {
    "message": "Learn More"
  },
  "studyTitle": {
    "message": "DNS Over HTTPS Studies"
  },
  "studyIntro": {
    "message": "Domain Name Service (DNS) is one of the oldest parts of internet architecture, yet remains largely untouched by efforts to make the web safer and more private. On the $BRANDSHORTNAME$ team, we’re working to change that. We’ve already implemented the DNS over HTTPS (DoH) protocol in $BRANDSHORTNAME$ and are studying a service that keeps DNS providers from collecting and sharing your browsing history.",
    "placeholders": {
      "brandshortname": {
        "content": "$1"
      }
    }
  },
  "studyWorkTitle": {
    "message": "How the studies work"
  },
  "studyWork": {
    "message": "We are running a series of studies to measure performance improvements when using DNS over HTTPS (DoH) to resolve hosts to IP addresses. $MOZILLABLOGLINK$, Firefox will:",
    "placeholders": {
      "mozillabloglink": {
        "content": "$1"
      }
    }
  },
  "loadAkamaiFiles": {
    "message": "load test files from Akamai using regular DNS and DoH,"
  },
  "loadFacebookFiles": {
    "message": "load test files from Facebook (if you are logged in) using regular DNS, DoH, and DoH with EDNS Client Subnet, and then"
  },
  "compareResponseTimes": {
    "message": "compare the response time of the different resolvers."
  },
  "cloudflareConnection": {
    "message": "The connection between the Cloudflare DoH server and Facebook's DNS server is encrypted and the test files do not contain any personal information."
  },
  "studyLink": {
    "message": "studies"
  },
  "cloudflareLink": {
    "message": "1.1.1.1 secure DNS over HTTPS"
  },
  "mozillaBlogLink": {
    "message": "In this study"
  },
  "studyDataDesc": {
    "message": "Cloudflare, like any other DNS provider, needs access to the host names you use to resolve requests. We’ve chosen Cloudflare as our partner for these studies because, unlike many other DNS providers, they agreed to $POLICYLINK$ that include limits on what data they collect and how long they keep it, as well as a promise to not share data with other parties. The performance measurement servers do not collect any personal information except for the source IP from which downloads originate and this information is not shared with other parties. The payload sent to Facebook does not contain any personal information, and is sent only if you are already logged into Facebook.",
    "placeholders": {
      "policylink": {
        "content": "$1"
      }
    }
  },
  "policyLink": {
    "message": "strong privacy controls"
  },
  "studyOptOutTitle": {
    "message": "How you can opt out of studies"
  },
  "studyOptOut": {
    "message": "If you don’t want to participate in this DNS study, you can disable it on the about:studies page in Firefox. (Type about:studies into the $BRANDSHORTNAME$ address bar.)"
  },
  "studyOptOutAll": {
    "message": "To disable all studies in Firefox, you can update your Privacy and Security settings in about:preferences."
  },
  "browserActionTitle": {
    "message": "DNS Over HTTPS"
  }
}
