{
  "extensionName": {
    "message": "DNS Over HTTPS"
  },
  "extensionDescriptionIntro": {
    "message": "Mozilla führt eine Reihe von Studien durch, um einen Dienst zu evaluieren, der DNS-Anbieter daran hindert, Ihre Surf-Chronik aufzuzeichnen und weiterzugeben. Alle Anwender in der Studie erhalten eine Benachrichtigung. Wenn eine Studie aktiv ist, verwendet Firefox automatisch den sicheren DNS über HTTPS 1.1.1.1 von Cloudflare. Diese Studie verwendet den Cloudflare-Resolver zusätzlich zum durch den Nutzer oder den Internetanbieter vorgegebenen DNS, um die Herangehensweisen zu vergleichen."
  },
  "extensionDescriptionDataTitle": {
    "message": "Was mit Ihren Daten passiert"
  },
  "extensionDescriptionDataDesc": {
    "message": "Wie alle anderen DNS-Anbieter benötigt Cloudflare Zugang zu den von Ihnen verwendeten Hostnamen, um Anfragen aufzulösen. Wir haben Cloudflare als unseren Partner für diese Studien gewählt, weil sie, anders als viele andere DNS-Anbieter, umfassenden Datenschutzregeln zugestimmt haben, die auch begrenzen, welche Daten gesammelt und wie lange sie aufbewahrt werden, sowie die Zusicherung, dass diese nicht an Dritte weitergegeben werden. Unter https://tinyurl.com/yax6zfqo finden Sie die Datenschutzerklärung von Cloudflare/Firefox."
  },
  "extensionDescriptionDisableTitle": {
    "message": "Wie Sie DNS-Studien deaktivieren können"
  },
  "extensionDescriptionDisableDesc": {
    "message": "Wenn Sie nicht an dieser Studie teilnehmen möchten, können Sie die Schaltfläche „Deaktivieren“ am Ende dieser Seite verwenden. Wenn Sie alle Studien in Firefox deaktivieren möchten, können Sie die Einstellungen in about:preferences im Bereich Datenschutz und Sicherheit ändern."
  },
  "notificationMessage": {
    "message": "Mozilla arbeitet daran, Datenschutz und Sicherheit im Internet zu verbessern. Wir führen Studien durch, die verschlüsselte DNS-Anfragen an Cloudflare senden, einen sicheren, cloud-basierten Dienst."
  },
  "disableButtonText": {
    "message": "DNS-Studien deaktivieren"
  },
  "acceptButtonText": {
    "message": "Ok, verstanden"
  },
  "learnMoreLinkText": {
    "message": "Weitere Informationen"
  },
  "studyTitle": {
    "message": "Studien zu DNS über HTTPS"
  },
  "studyIntro": {
    "message": "Domain Name Service (DNS) ist einer der ältesten Teile der Internetarchitektur, wird aber dennoch kaum angetastet, wenn es um Versuche geht, das Internet sicherer und privater zu gestalten. Wir im Firefox-Team arbeiten daran, das zu ändern. Wir haben bereits das Protokoll DNS over HTTPS (DoH) in $BRANDSHORTNAME$ implementiert und forschen über einen Dienst, der DNS-Anbieter daran hindert, Ihre Surf-Chronik zu aufzuzeichnen und weiterzugeben.",
    "placeholders": {
      "brandshortname": {
        "content": "$1"
      }
    }
  },
  "studyWorkTitle": {
    "message": "Wie die Studien funktionieren"
  },
  "studyWork": {
    "message": "Wir führen eine Reihe von $STUDYLINK$ in $BRANDSHORTNAME$ durch. Alle Anwender erhalten eine Benachrichtigung über diese Studien. Wenn eine Studie aktiv ist, verwendet $BRANDFULLNAME$ automatisch den $CLOUDFLARELINK$ von Cloudflare. Die erste Studie verwendet den Cloudflare-Resolver zusätzlich zum durch den Nutzer oder den Internetanbieter vorgegebenen DNS, um die Herangehensweisen zu vergleichen.",
    "placeholders": {
      "studylink": {
        "content": "$1"
      },
      "brandshortname": {
        "content": "$2"
      },
      "brandfullname": {
        "content": "$3"
      },
      "cloudflarelink": {
        "content": "$4"
      }
    }
  },
  "studyLink": {
    "message": "Studien"
  },
  "cloudflareLink": {
    "message": "sicheren DNS über HTTPS 1.1.1.1"
  },
  "studyDataDesc": {
    "message": "Wie alle anderen DNS-Anbieter benötigt Cloudflare Zugang zu den von Ihnen verwendeten Hostnamen, um Anfragen aufzulösen. Wir haben Cloudflare als unseren Partner für diese Studien gewählt, weil sie, anders als viele andere DNS-Anbieter, $POLICYLINK$ zugestimmt haben, die auch begrenzen, welche Daten gesammelt und wie lange sie aufbewahrt werden, sowie die Zusicherung, dass diese nicht an Dritte weitergegeben werden.",
    "placeholders": {
      "policylink": {
        "content": "$1"
      }
    }
  },
  "policyLink": {
    "message": "umfassenden Datenschutzregeln"
  },
  "studyOptOutTitle": {
    "message": "Wie Sie Ihre Zustimmung zu Studien verweigern können"
  },
  "studyOptOut": {
    "message": "Wenn Sie nicht an diesen DNS-Studien teilnehmen möchten, können Sie die Schaltfläche „DNS-Studien deaktivieren“ am Ende dieser Seite verwenden. Sie können diese auch über die Seite about:studies in Firefox deaktivieren (geben Sie about:studies in die Firefox-Adressleiste ein)."
  },
  "studyOptOutAll": {
    "message": "Um alle Studien in Firefox zu deaktivieren, können Sie Ihre Datenschutz- und Sicherheitseinstellungen in about:preferences ändern."
  }
}