{
  "extensionName": {
    "message": "DNS через HTTPS"
  },
  "extensionDescriptionIntro": {
    "message": "Mozilla запускает серию исследований для тестирования службы, которая огородит историю веб-сёрфинга от сбора и передачи DNS-провайдерами. Все участники исследования получат оповещение. Когда исследование станет активным, Firefox будет автоматически использовать защищённый по HTTPS DNS-сервер Cloudflare с IP-адресом 1.1.1.1. Это исследование будет использовать DNS-сервер Cloudflare в дополнение к DNS-серверам, выбранных пользователем или его интернет-провайдером, для сравнения результатов."
  },
  "extensionDescriptionDataTitle": {
    "message": "Что случится с моими данными"
  },
  "extensionDescriptionDataDesc": {
    "message": "Cloudflare, как и любому другому DNS-провайдеру, требуется доступ к именам узлов, которые вы используете для выполнения запросов. Мы выбрали Cloudflare нашим партнёром для этой серии исследований, так как он, в отличие от других DNS-провайдеров, согласился на наши строгие параметры приватности, которые включают в себя ограничения на то, какие данные он может собирать и как долго может их хранить, а также обещание, что он не будет делиться данными с третьими сторонами. Прочитайте политику приватности Cloudflare/Firefox по адресу https://tinyurl.com/yax6zfqo"
  },
  "extensionDescriptionDisableTitle": {
    "message": "Как я могу отключить исследование «DNS через HTTPS»"
  },
  "extensionDescriptionDisableDesc": {
    "message": "Если вы не хотите участвовать в этом исследовании, вы можете щёлкнуть по кнопке «Отключить» на этой странице. Чтобы отключить все исследования в Firefox, вы можете изменить настройку в разделе «Приватность и Защита» по адресу about:preferences."
  },
  "notificationMessage": {
    "message": "Mozilla работает над улучшением приватности и безопасности Интернета. Мы проводим исследования, которые отправляют зашифрованные DNS-запросы в Cloudflare, защищённый облачный сервис."
  },
  "disableButtonText": {
    "message": "Отключить исследование «DNS через HTTPS»"
  },
  "acceptButtonText": {
    "message": "OK, понятно"
  },
  "learnMoreLinkText": {
    "message": "Подробнее"
  },
  "studyTitle": {
    "message": "Исследование «DNS через HTTPS»"
  },
  "studyIntro": {
    "message": "Система доменных имён (DNS) — одна из старейших частей инфраструктуры Интернета, которая пока не затронута попытками сделать Интернет безопаснее и приватнее. В команде Firefox мы работаем над тем, чтобы изменить это. Мы уже реализовали протокол DNS через HTTPS (DoH) в $BRANDSHORTNAME$ и пытаемся создать сервис, который сделает невозможным сбор и передачу вашей истории веб-сёрфинга DNS-провайдерами.",
    "placeholders": {
      "brandshortname": {
        "content": "$1"
      }
    }
  },
  "studyWorkTitle": {
    "message": "Как работает исследование"
  },
  "studyWork": {
    "message": "Мы запускаем серию $STUDYLINK$ в $BRANDSHORTNAME$. Все пользователи получат уведомление об этих исследованиях. Когда исследование станет активным, $BRANDFULLNAME$ будет автоматически использовать $CLOUDFLARELINK$ от компании Cloudflare. Первое исследование будет использовать DNS-сервер Cloudflare в дополнение к DNS-серверам, выбранным пользователем или его интернет-провайдером, для сравнения результатов.",
    "placeholders": {
      "studylink": {
        "content": "$1"
      },
      "brandshortname": {
        "content": "$2"
      },
      "brandfullname": {
        "content": "$3"
      },
      "cloudflarelink": {
        "content": "$4"
      }
    }
  },
  "studyLink": {
    "message": "исследований"
  },
  "cloudflareLink": {
    "message": "защищённый по HTTPS DNS-сервер 1.1.1.1"
  },
  "studyDataDesc": {
    "message": "Cloudflare, как и любому другому DNS-провайдеру, требуется доступ к именам узлов, которые вы используете для выполнения запросов. Мы выбрали Cloudflare нашим партнёром для этой серии исследований, так как он, в отличие от других DNS-провайдеров, согласился на $POLICYLINK$, которые включают в себя ограничения на то, какие данные он может собирать и как долго их может хранить, а также обещание, что он не будет делиться данными с третьими сторонами.",
    "placeholders": {
      "policylink": {
        "content": "$1"
      }
    }
  },
  "policyLink": {
    "message": "строгие настройки приватности"
  },
  "studyOptOutTitle": {
    "message": "Как я могу выйти из исследования"
  },
  "studyOptOut": {
    "message": "Если вы не хотите участвовать в этих исследованиях по DNS, вы можете нажать кнопку «Отключить исследование «DNS через HTTPS»» на этой странице. Вы также можете отключить их на странице about:studies в Firefox. (Наберите about:studies в адресной строке Firefox)."
  },
  "studyOptOutAll": {
    "message": "Чтобы отключить все исследования в Firefox, вы можете изменить параметр в разделе настроек «Приватность и Защита» по адресу about:preferences."
  }
}